using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ParsForJournal
{
    public static class StudyData
    {
        public static readonly Dictionary<string, Dictionary<string, string>> Lessons = new Dictionary<string, Dictionary<string, string>>()
        {
            ["100"] = new Dictionary<string, string>()
            {
                ["7374"] = "Биология",
                ["7367"] = "География",
                ["7179"] = "Иностранный язык",
                ["7172"] = "Информатика/Гр.1",
                ["7845"] = "Информатика/Гр.2",
                ["7174"] = "История",
                ["7177"] = "Литература",
                ["7173"] = "Математика",
                ["7175"] = "Обществознание",
                ["7181"] = "Основы безопасности и защиты Родины",
                ["7368"] = "Основы бережливого производства",
                ["7376"] = "Основы исследовательской и проектной деятельности",
                ["7178"] = "Русский язык",
                ["8058"] = "Самостоятельная подготовка",
                ["7375"] = "Физика",
                ["7176"] = "Физическая культура",
                ["7171"] = "Химия"
            },
            ["101"] = new Dictionary<string, string>()
            {
                ["7184"] = "Биология",
                ["7197"] = "География",
                ["7194"] = "Иностранный язык",
                ["7187"] = "Информатика/Гр.1",
                ["7846"] = "Информатика/Гр.2",
                ["7189"] = "История",
                ["7192"] = "Литература",
                ["7188"] = "Математика",
                ["7190"] = "Обществознание",
                ["7196"] = "Основы безопасности и защиты Родины",
                ["7369"] = "Основы бережливого производства",
                ["7195"] = "Основы исследовательской и проектной деятельности",
                ["7193"] = "Русский язык",
                ["8059"] = "Самостоятельная подготовка",
                ["7185"] = "Физика",
                ["7191"] = "Физическая культура",
                ["7186"] = "Химия"
            },
            ["102"] = new Dictionary<string, string>()
            {
                ["7199"] = "Биология",
                ["7212"] = "География",
                ["7209"] = "Иностранный язык",
                ["7202"] = "Информатика/Гр.1",
                ["7847"] = "Информатика/Гр.2",
                ["7204"] = "История",
                ["7207"] = "Литература",
                ["7203"] = "Математика",
                ["7205"] = "Обществознание",
                ["7211"] = "Основы безопасности и защиты Родины",
                ["7370"] = "Основы бережливого производства",
                ["7210"] = "Основы исследовательской и проектной деятельности",
                ["7208"] = "Русский язык",
                ["8060"] = "Самостоятельная подготовка",
                ["7200"] = "Физика",
                ["7206"] = "Физическая культура",
                ["7201"] = "Химия"
            },
            ["103"] = new Dictionary<string, string>()
            {
                ["7214"] = "Биология",
                ["7227"] = "География",
                ["7224"] = "Иностранный язык",
                ["7217"] = "Информатика/Гр.1",
                ["7848"] = "Информатика/Гр.2",
                ["7219"] = "История",
                ["7222"] = "Литература",
                ["7218"] = "Математика",
                ["7220"] = "Обществознание",
                ["7226"] = "Основы безопасности и защиты Родины",
                ["7371"] = "Основы бережливого производства",
                ["7225"] = "Основы исследовательской и проектной деятельности",
                ["7223"] = "Русский язык",
                ["8061"] = "Самостоятельная подготовка",
                ["7215"] = "Физика",
                ["7221"] = "Физическая культура",
                ["7216"] = "Химия"
            },
            ["104"] = new Dictionary<string, string>()
            {
                ["7229"] = "Биология",
                ["7242"] = "География",
                ["7239"] = "Иностранный язык",
                ["7232"] = "Информатика/Гр.1",
                ["7849"] = "Информатика/Гр.2",
                ["7234"] = "История",
                ["7237"] = "Литература",
                ["7233"] = "Математика",
                ["7235"] = "Обществознание",
                ["7241"] = "Основы безопасности и защиты Родины",
                ["7372"] = "Основы бережливого производства",
                ["7240"] = "Основы исследовательской и проектной деятельности",
                ["7238"] = "Русский язык",
                ["8095"] = "Самостоятельная подготовка",
                ["7230"] = "Физика",
                ["7236"] = "Физическая культура",
                ["7231"] = "Химия"
            },
            ["105"] = new Dictionary<string, string>()
            {
                ["7244"] = "Биология",
                ["7257"] = "География",
                ["7254"] = "Иностранный язык",
                ["7247"] = "Информатика/Гр.1",
                ["7850"] = "Информатика/Гр.2",
                ["7249"] = "История",
                ["7252"] = "Литература",
                ["7248"] = "Математика",
                ["7250"] = "Обществознание",
                ["7256"] = "Основы безопасности и защиты Родины",
                ["7373"] = "Основы бережливого производства",
                ["7255"] = "Основы исследовательской и проектной деятельности",
                ["7253"] = "Русский язык",
                ["8063"] = "Самостоятельная подготовка",
                ["7245"] = "Физика",
                ["7251"] = "Физическая культура",
                ["7246"] = "Химия"
            },
            ["106"] = new Dictionary<string, string>()
            {
                ["7437"] = "Биология",
                ["7434"] = "География",
                ["7284"] = "Иностранный язык",
                ["7277"] = "Информатика/Гр.1",
                ["7851"] = "Информатика/Гр.2",
                ["7279"] = "История",
                ["7282"] = "Литература",
                ["7278"] = "Математика",
                ["7280"] = "Обществознание",
                ["7286"] = "Основы безопасности и защиты Родины",
                ["7439"] = "Основы исследовательской и проектной деятельности",
                ["7435"] = "Природопользование и обеспечение экологической безопасности",
                ["7283"] = "Русский язык",
                ["8065"] = "Самостоятельная подготовка",
                ["7438"] = "Физика",
                ["7281"] = "Физическая культура",
                ["7276"] = "Химия"
            },
            ["107"] = new Dictionary<string, string>()
            {
                ["7289"] = "Биология",
                ["7302"] = "География",
                ["7299"] = "Иностранный язык",
                ["7292"] = "Информатика/Гр.1",
                ["7852"] = "Информатика/Гр.2",
                ["7294"] = "История",
                ["7297"] = "Литература",
                ["7293"] = "Математика",
                ["7295"] = "Обществознание",
                ["7301"] = "Основы безопасности и защиты Родины",
                ["7300"] = "Основы исследовательской и проектной деятельности",
                ["7436"] = "Природопользование и обеспечение экологической безопасности",
                ["7298"] = "Русский язык",
                ["8066"] = "Самостоятельная подготовка",
                ["7290"] = "Физика",
                ["7296"] = "Физическая культура",
                ["7291"] = "Химия"
            },
            ["110"] = new Dictionary<string, string>()
            {
                ["7396"] = "Административное право",
                ["7409"] = "Деятельность подразделений полиции",
                ["7392"] = "Иностранный язык в профессиональной деятельности",
                ["7404"] = "Информационные технологии в профессиональной деятельности/гр.ПК1",
                ["7853"] = "Информационные технологии в профессиональной деятельности/гр.ПК2",
                ["7393"] = "История России",
                ["7402"] = "Конституционное право России",
                ["7403"] = "Криминалистика",
                ["7406"] = "Криминология",
                ["7400"] = "Огневая подготовка",
                ["7410"] = "Оперативно-розыскная деятельность",
                ["7405"] = "Основы финансовой грамотности",
                ["7408"] = "Производственная практика ПП.03",
                ["7401"] = "Психология в деятельности правоохранительных органов",
                ["8019"] = "Психология и этика в профессиональной деятельности",
                ["7397"] = "Русский язык в сфере профессиональной коммуникации",
                ["8064"] = "Самостоятельная подготовка",
                ["7399"] = "Тактико-специальная подготовка",
                ["7395"] = "Теория государства и права",
                ["7398"] = "Трудовое право",
                ["7407"] = "Учебная практика УП.03",
                ["7266"] = "Физическая культура"
            },

            ["112"] = new Dictionary<string, string>()
            {
                ["7445"] = "Административное право",
                ["7454"] = "Административный процесс",
                ["7441"] = "Безопасность жизнедеятельности",
                ["7457"] = "Гражданский процесс",
                ["7450"] = "Гражданское право",
                ["7442"] = "Иностранный язык в профессиональной деятельности",
                ["7451"] = "Информационные технологии в юридической деятельности",
                ["7443"] = "История России",
                ["7444"] = "Конституционное право России",
                ["7448"] = "Организационное обеспечение деятельности органов прокуратуры",
                ["7449"] = "Основы финансовой грамотности",
                ["7456"] = "Производственная практика ПП.01",
                ["7452"] = "Психология и этика в профессиональной деятельности",
                ["7446"] = "Русский язык в сфере профессиональной коммуникации",
                ["8070"] = "Самостоятельная подготовка",
                ["7447"] = "Судоустройство и правоохранительные органы",
                ["7440"] = "Теория государства и права",
                ["7453"] = "Трудовое право",
                ["7455"] = "Учебная практика УП.01",
                ["7383"] = "Физическая культура"
            },

            ["120"] = new Dictionary<string, string>()
            {
                ["7304"] = "Биология",
                ["7431"] = "География",
                ["7314"] = "Иностранный язык",
                ["7307"] = "Информатика/Гр.1",
                ["7854"] = "Информатика/Гр.2",
                ["7309"] = "История",
                ["7312"] = "Литература",
                ["7308"] = "Математика",
                ["7310"] = "Обществознание",
                ["7316"] = "Основы безопасности и защиты Родины",
                ["7315"] = "Основы исследовательской и проектной деятельности",
                ["7432"] = "Природопользование и обеспечение экологической безопасности",
                ["7313"] = "Русский язык",
                ["8067"] = "Самостоятельная подготовка",
                ["7305"] = "Физика",
                ["7311"] = "Физическая культура",
                ["7306"] = "Химия"
            },

            ["121"] = new Dictionary<string, string>()
            {
                ["7319"] = "Биология",
                ["7332"] = "География",
                ["7329"] = "Иностранный язык",
                ["7322"] = "Информатика/Гр.1",
                ["7855"] = "Информатика/Гр.2",
                ["7324"] = "История",
                ["7327"] = "Литература",
                ["7323"] = "Математика",
                ["7325"] = "Обществознание",
                ["7331"] = "Основы безопасности и защиты Родины",
                ["7330"] = "Основы исследовательской и проектной деятельности",
                ["7433"] = "Природопользование и обеспечение экологической безопасности",
                ["7328"] = "Русский язык",
                ["8068"] = "Самостоятельная подготовка",
                ["7320"] = "Физика",
                ["7326"] = "Физическая культура",
                ["7321"] = "Химия"
            },

            ["130"] = new Dictionary<string,string>()
            {
                ["7423"] = "Безопасность жизнедеятельности",
                ["7420"] = "Изучение основ делопроизводства",
                ["7417"] = "Иностранный язык (второй)",
                ["7411"] = "Иностранный язык в профессиональной деятельности",
                ["7419"] = "Информационная и организационная поддержка экскурсовода (гида) при оказании экскурсионных услуг",
                ["7416"] = "Информационно-коммуникационные технологии в туризме и гостеприимстве",
                ["7415"] = "Историко-культурное наследие регионов",
                ["7412"] = "История России",
                ["7426"] = "Координация работы служб предприятий туризма и гостеприимства",
                ["7424"] = "Основы финансовой грамотности",
                ["7422"] = "Осуществление расчетов с клиентом за предоставление услуги туризма и гостеприимства",
                ["7414"] = "Правовое и документационное обеспечение в туризме и гостеприимстве",
                ["7429"] = "Предоставление турагентских услуг",
                ["7428"] = "Предоставление туроператорских услуг",
                ["7427"] = "Производственная практика ПП.01",
                ["7425"] = "Реклама в социально-культурном сервисе и туризме",
                ["8069"] = "Самостоятельная подготовка",
                ["7413"] = "Сервисная деятельность в туризме и гостеприимстве",
                ["7421"] = "Соблюдение норм этики делового общения",
                ["7418"] = "Учебная практика УП.01",
                ["7430"] = "Учебная практика УП.03",
                ["7341"] = "Физическая культура"
            },

            ["160"] = new Dictionary<string, string>()
            {
                ["7139"] = "Биология",
                ["7350"] = "География",
                ["7149"] = "Иностранный язык",
                ["7142"] = "Информатика/Гр.1",
                ["7856"] = "Информатика/Гр.2",
                ["7144"] = "История",
                ["7147"] = "Литература",
                ["7143"] = "Математика",
                ["7145"] = "Обществознание",
                ["7151"] = "Основы безопасности и защиты Родины",
                ["7150"] = "Основы исследовательской и проектной деятельности",
                ["7349"] = "Основы финансовой грамотности",
                ["7148"] = "Русский язык",
                ["7927"] = "Самостоятельная подготовка",
                ["7140"] = "Физика",
                ["7146"] = "Физическая культура",
                ["7141"] = "Химия"
            }

        };
    }
}
